
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Если ЗначениеЗаполнено(Контрагент) Тогда
		
		Если СтатусЗаявки = Перечисления.СтатусыЗаявок.Новая Тогда
			СменитьРодителя("Заявители");
		ИначеЕсли СтатусЗаявки = Перечисления.СтатусыЗаявок.ВЛистОжидания Тогда
			СменитьРодителя("Лист ожидания");
		ИначеЕсли СтатусЗаявки = Перечисления.СтатусыЗаявок.Отклонено Тогда
			СменитьРодителя("Отказ");
		ИначеЕсли СтатусЗаявки = Перечисления.СтатусыЗаявок.ВРаботе Тогда
			СменитьРодителя("Клиенты");
		КонецЕсли;
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	УправлениеСтатусомЗаявок.ИсточникЗаявки КАК ИсточникЗаявки
		|ИЗ
		|	РегистрСведений.УправлениеСтатусомЗаявок КАК УправлениеСтатусомЗаявок
		|ГДЕ
		|	УправлениеСтатусомЗаявок.СсылкаНаКонтрагента = &СсылкаНаКонтрагента";
		
		Запрос.УстановитьПараметр("СсылкаНаКонтрагента", Контрагент);
		РезультатЗапроса = Запрос.Выполнить();
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			ИсточникЗаявки = ВыборкаДетальныеЗаписи.ИсточникЗаявки;
		КонецЦикла;
		
		ДатаДокумента = ЭтотОбъект.Дата + 1;
		
		Движения.УправлениеСтатусомЗаявок.Записывать = Истина;
		Движение = Движения.УправлениеСтатусомЗаявок.Добавить();
		Движение.Дата = ДатаДокумента;
		Движение.СсылкаНаКонтрагента = Контрагент;
		Движение.ИсточникЗаявки = ИсточникЗаявки;
		Движение.СтатусЗаявки = СтатусЗаявки;
		Движение.Период = ДатаДокумента;
	Иначе
		Отказ = Истина;
		Сообщить("Контрагент не найден!");
	КонецЕсли;
	
КонецПроцедуры

Процедура СменитьРодителя(ИмяНовойГруппы)
	
    Элемент = ЭтотОбъект.Контрагент.ПолучитьОбъект();
    НоваяГруппа = Справочники.Контрагенты.НайтиПоНаименованию(ИмяНовойГруппы);
    
    Если Не НоваяГруппа.Пустая() Тогда
        Элемент.Родитель = НоваяГруппа;
        Попытка
            Элемент.Записать();
            Сообщить("Родитель изменён на: " + ИмяНовойГруппы);
        Исключение
            Сообщить("Ошибка записи: " + ОписаниеОшибки());
            Отказ = Истина;
        КонецПопытки;
    Иначе
        Сообщить("Группа '" + ИмяНовойГруппы + "' не найдена!");
        Отказ = Истина;
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)

	Если ТипЗнч(ДанныеЗаполнения) = Тип("СправочникСсылка.Контрагенты") Тогда
		Контрагент = ДанныеЗаполнения.Ссылка; 
		Комментарий = ДанныеЗаполнения.Комментарий;
	КонецЕсли;

КонецПроцедуры






