
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.СчетаНаОплату") Тогда 
		
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ
		|   СУММА(База.Сумма) КАК ИтоговаяСумма
		|ИЗ
		|   Документ.СчетаНаОплату.База КАК База
		|ГДЕ
		|   База.Ссылка = &Ссылка";
		Запрос.УстановитьПараметр("Ссылка", ДанныеЗаполнения.Ссылка);
		Результат = Запрос.Выполнить().Выбрать();
		Если Результат.Следующий() Тогда
			ИтоговаяСумма = Результат.ИтоговаяСумма;
		КонецЕсли;
		
		Контрагент = ДанныеЗаполнения.Контрагент;
		ДокументОснование = ДанныеЗаполнения.Ссылка;
		СуммаДокумента = ИтоговаяСумма;    
		ОплатаПоСчету = ДанныеЗаполнения.НомерСчета + " от " + Формат(ДанныеЗаполнения.ДатаСчета, "ДЛФ=DD");
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)

	Движения.ДенежныеСредства.Записывать = Истина;
	Движение = Движения.ДенежныеСредства.Добавить();
	Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
	Движение.Период = Дата;
	Движение.Контрагент = Контрагент;
	Движение.НомерСчета = ОплатаПоСчету;
	Движение.ДатаПоступления = ДатаПоступления;
	Движение.Сумма = СуммаДокумента;

КонецПроцедуры
