
&НаКлиенте
Процедура Обновить(Команда)    
    ЗаполнитьДанныеНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьЗаявкиИзПочты(Команда)
	ОткрытьФорму("Обработка.ЗаказПоПочте.Форма.Форма");
КонецПроцедуры  

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
    ЗаполнитьДанныеНаСервере(); 
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДанныеНаСервере()  
	
	// Получаем ссылки на группы-родители
	ГруппаСоискатели = Справочники.Контрагенты.НайтиПоНаименованию("Соискатели");
	ГруппаЗаявители  = Справочники.Контрагенты.НайтиПоНаименованию("Заявители");
	ГруппаКлиенты    = Справочники.Контрагенты.НайтиПоНаименованию("Клиенты");
	ГруппаВОжидании  = Справочники.Контрагенты.НайтиПоНаименованию("Лист ожидания");
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|   ""Соискатели"" КАК ИмяГруппы,
	|   КОЛИЧЕСТВО(*) КАК Количество
	|ИЗ
	|   Справочник.Контрагенты КАК Контрагенты
	|ГДЕ
	|   Контрагенты.Родитель = &Соискатели
	|   И Контрагенты.ПометкаУдаления = ЛОЖЬ
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|   ""Заявители"", 
	|   КОЛИЧЕСТВО(*)
	|ИЗ
	|   Справочник.Контрагенты
	|ГДЕ
	|   Родитель = &Заявители
	|   И ПометкаУдаления = ЛОЖЬ
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|   ""Клиенты"",
	|   КОЛИЧЕСТВО(*)   
	|ИЗ
	|   Справочник.Контрагенты
	|ГДЕ
	|   Родитель = &Клиенты
	|   И ПометкаУдаления = ЛОЖЬ
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|   ""ВОжидании"",
	|   КОЛИЧЕСТВО(*)
	|ИЗ
	|   Справочник.Контрагенты
	|ГДЕ
	|   Родитель = &ВОжидании
	|   И ПометкаУдаления = ЛОЖЬ";
	
	Запрос.УстановитьПараметр("Соискатели", ГруппаСоискатели);
	Запрос.УстановитьПараметр("Заявители",  ГруппаЗаявители);
	Запрос.УстановитьПараметр("Клиенты",    ГруппаКлиенты);
	Запрос.УстановитьПараметр("ВОжидании",  ГруппаВОжидании);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	КоличествоСоискателей = 0;
	КоличествоЗаявителей  = 0;
	КоличествоКлиентов    = 0;
	КоличествоВОжидании   = 0;
	
	Пока Выборка.Следующий() Цикл
		Если Выборка.ИмяГруппы = "Соискатели" Тогда
			КоличествоСоискателей = Выборка.Количество;
		ИначеЕсли Выборка.ИмяГруппы = "Заявители" Тогда
			КоличествоЗаявителей = Выборка.Количество;
		ИначеЕсли Выборка.ИмяГруппы = "Клиенты" Тогда
			КоличествоКлиентов = Выборка.Количество;
		ИначеЕсли Выборка.ИмяГруппы = "ВОжидании" Тогда
			КоличествоВОжидании = Выборка.Количество;
		КонецЕсли;
	КонецЦикла; 
	
	Объект.Соискатели = КоличествоСоискателей; 
	Объект.Заявители = КоличествоЗаявителей;
	Объект.Клиенты = КоличествоКлиентов;
	Объект.ВОжидании = КоличествоВОжидании;
		
КонецПроцедуры
