#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Возвращает сведения о внешней печатной форме.
Функция СведенияОВнешнейОбработке() Экспорт
    
    ПараметрыРегистрации = ДополнительныеОтчетыИОбработки.СведенияОВнешнейОбработке("3.1.11.189");
    ПараметрыРегистрации.Информация = НСтр("ru = 'Счет на оплату'");
    ПараметрыРегистрации.Вид = ДополнительныеОтчетыИОбработкиКлиентСервер.ВидОбработкиПечатнаяФорма(); 
    ПараметрыРегистрации.Версия = "1.0.1.1";
    ПараметрыРегистрации.Назначение.Добавить("Документ.СчетаНаОплату"); 
	
    
    Команда = ПараметрыРегистрации.Команды.Добавить();
    Команда.Представление = НСтр("ru = 'Счет на оплату'");
    Команда.Идентификатор = "СчетНаОплатуСерверный";
    Команда.Использование = ДополнительныеОтчетыИОбработкиКлиентСервер.ТипКомандыВызовСерверногоМетода(); 
    Команда.Модификатор   = "ПечатьMXL"; 
    
    Возврат ПараметрыРегистрации;
КонецФункции

#КонецОбласти   

#Область СлужебныйПрограммныйИнтерфейс

Процедура Печать(МассивОбъектов, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт 
    
    ПечатнаяФорма = УправлениеПечатью.СведенияОПечатнойФорме(КоллекцияПечатныхФорм, "СчетНаОплатуСерверный"); 
    Если ПечатнаяФорма <> Неопределено Тогда
        ПечатнаяФорма.ТабличныйДокумент = СформироватьСчетНаОплату(МассивОбъектов, ОбъектыПечати); 
        ПечатнаяФорма.СинонимМакета = НСтр("ru = 'Счет на оплату'");
    КонецЕсли;
    
КонецПроцедуры 

#КонецОбласти     

#Область СлужебныеПроцедурыИФункции

Функция СформироватьСчетНаОплату(МассивОбъектов, ОбъектыПечати)
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|    СчетаНаОплату.Ссылка КАК Ссылка,
	|    СчетаНаОплату.Организация КАК Организация,
	|    СчетаНаОплату.Контрагент КАК Контрагент,
	|    СчетаНаОплату.ИНН КАК ИНН,     
	|    СчетаНаОплату.НомерСчета КАК НомерСчета,
	|    СчетаНаОплату.ДатаСчета КАК ДатаСчета, 
	|    СчетаНаОплату.СуммаДокумента КАК СуммаДокумента,
	|	 СчетаНаОплату.База.(
	|		НомерСтроки КАК НомерСтроки,
	|		Наименование КАК БазаНаименование,
	|		Количество КАК Количество,
	|		Цена КАК Цена,
	|		Сумма КАК Сумма
	|	 ) КАК База,
	|	 СчетаНаОплату.Дополнительно.(
	|		НомерСтроки КАК НомерСтроки,
	|		Наименование КАК ДополнительноНаименование,
	|		Количество КАК Количество,
	|		Цена КАК Цена,
	|		Сумма КАК Сумма
	|	 ) КАК Дополнительно
	|ИЗ
	|    Документ.СчетаНаОплату КАК СчетаНаОплату
	|ГДЕ
	|    СчетаНаОплату.Ссылка В(&СписокДокументов)
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки";
	
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("СписокДокументов", МассивОбъектов);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.КлючПараметровПечати = "СчетНаОплатуСерверный";
	
	Макет = ПолучитьМакет("ПФ_MXL_СчетНаОплату");
	
	ОбластьШапка = Макет.ПолучитьОбласть("Шапка"); 
	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	ОбластьШапкаТаблицы = Макет.ПолучитьОбласть("ШапкаТаблицы"); 
	ОбластьТаблицаБаза = Макет.ПолучитьОбласть("ТаблицаБаза"); 
	ОбластьТаблицаДополнительно = Макет.ПолучитьОбласть("ТаблицаДополнительно");  
	ОбластьПодвалТаблица = Макет.ПолучитьОбласть("ПодвалТаблица");
	ОбластьПодвал = Макет.ПолучитьОбласть("Подвал");
	
	Пока Выборка.Следующий() Цикл
		Если ТабличныйДокумент.ВысотаТаблицы > 0 Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		
		ДанныеОрганизации = ОрганизацииСервер.СведенияОбОрганизации(Выборка.Организация);
		ПредставлениеОрганизации = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru='%1 %2'"), 
		ДанныеОрганизации.КраткийТипОрганизации, 
		ДанныеОрганизации.Наименование); 
		ИНН = ДанныеОрганизации.ИНН;   
		ОГРНИП = ДанныеОрганизации.ОГРНИП;   
		Адрес = ДанныеОрганизации.Адрес; 
		Телефон = ДанныеОрганизации.Телефон; 
		НаименованиеБанка = ДанныеОрганизации.НаименованиеБанка;
		РасчетныйСчет = ДанныеОрганизации.РасчетныйСчет;
		КорСчет = ДанныеОрганизации.КорСчет;
		БИК = ДанныеОрганизации.БИК;
		КПП = ДанныеОрганизации.КПП;
		ИННБанка = ДанныеОрганизации.ИННБанка;
		ОКПО = ДанныеОрганизации.ОКПО;   
		Руководитель = ДанныеОрганизации.Руководитель;
		
		//ОбластьШапка
		ОбластьШапка.Параметры.ПредставлениеОрганизации = ПредставлениеОрганизации;   
		ОбластьШапка.Параметры.ИНН = ИНН;   
		ОбластьШапка.Параметры.ОГРНИП = ОГРНИП; 
		ОбластьШапка.Параметры.Адрес = Адрес;  
		ОбластьШапка.Параметры.Телефон = Телефон;   
		ОбластьШапка.Параметры.НаименованиеБанка = НаименованиеБанка;
		ОбластьШапка.Параметры.РасчетныйСчет = РасчетныйСчет;
		ОбластьШапка.Параметры.КорСчет = КорСчет;
		ОбластьШапка.Параметры.БИК = БИК;
		ОбластьШапка.Параметры.КПП = КПП;
		ОбластьШапка.Параметры.ИННБанка = ИННБанка;
		ОбластьШапка.Параметры.ОКПО = ОКПО;	
		ТабличныйДокумент.Вывести(ОбластьШапка);    
		
		//ОбластьЗаголовок
	    ОбластьЗаголовок.Параметры.Контрагент = Выборка.Контрагент;    
		ОбластьЗаголовок.Параметры.ИНН = Выборка.ИНН;   
		ОбластьЗаголовок.Параметры.НомерСчета = Выборка.НомерСчета;
		ОбластьЗаголовок.Параметры.ДатаСчета = Формат(Выборка.ДатаСчета, "ДЛФ=DD");
	    ТабличныйДокумент.Вывести(ОбластьЗаголовок);	
		
		//ОбластьШапкаТаблицы
        ТабличныйДокумент.Вывести(ОбластьШапкаТаблицы); 
		
		//ОбластьТаблицаБаза   
		НомерТовара = 0;  
		ВыборкаБаза = Выборка.База.Выбрать();
		Если ВыборкаБаза.Количество() Тогда
			Пока ВыборкаБаза.Следующий() Цикл 
				НомерТовара = НомерТовара + 1;
				ОбластьТаблицаБаза.Параметры.Номер = НомерТовара;
				ОбластьТаблицаБаза.Параметры.Заполнить(ВыборкаБаза);
				ТабличныйДокумент.Вывести(ОбластьТаблицаБаза, ВыборкаБаза.Уровень()); 
			КонецЦикла;
		КонецЕсли;   
		
		//ОбластьТаблицаДополнительно         
		ВыборкаДополнительно = Выборка.Дополнительно.Выбрать();
		Если ВыборкаДополнительно.Количество() Тогда
			Пока ВыборкаДополнительно.Следующий() Цикл 
				НомерТовара = НомерТовара + 1;
				ОбластьТаблицаДополнительно.Параметры.Номер = НомерТовара;
				ОбластьТаблицаДополнительно.Параметры.Заполнить(ВыборкаДополнительно);
				ТабличныйДокумент.Вывести(ОбластьТаблицаДополнительно, ВыборкаДополнительно.Уровень()); 
			КонецЦикла;
		КонецЕсли;  
		
		//ОбластьПодвалТаблица     
		ОбластьПодвалТаблица.Параметры.СуммаДокумента = Выборка.СуммаДокумента;
		ТабличныйДокумент.Вывести(ОбластьПодвалТаблица);   
		
		//ОбластьПодвал  
		ОбластьПодвал.Параметры.Номер = НомерТовара;  
		ОбластьПодвал.Параметры.Руководитель = Руководитель; 
		ОбластьПодвал.Параметры.СуммаПрописью = ЧислоПрописью(Выборка.СуммаДокумента, "", "рубль, рубля, рублей, м, копейка, копейки, копеек, ж, 2");
		ОбластьПодвал.Параметры.СуммаДокумента = Формат(Выборка.СуммаДокумента, "ЧДЦ=2"); 
		ТабличныйДокумент.Вывести(ОбластьПодвал);

		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, НомерСтрокиНачало, ОбъектыПечати, Выборка.Ссылка);
		
	КонецЦикла; 
	
	Возврат ТабличныйДокумент;
    
КонецФункции

#КонецОбласти     

#Область Отладка

Функция ПечатьОтладка(МассивОбъектов) Экспорт
    
    ТабличныйДокумент = СформироватьСчетНаОплату(МассивОбъектов, Новый СписокЗначений); 
    Возврат ТабличныйДокумент; 
    
КонецФункции
    
#КонецОбласти

#КонецЕсли