

//&НаСервере
//Процедура ПолучитьДанныеОрганизации()
//    
//    Если Не ЗначениеЗаполнено(Объект.Организация) Тогда
//        Возврат;
//    КонецЕсли;
//    
//    ДатаДляПолученияДанных = Объект.Дата; // или ТекущаяДатаСеанса(), если нужна «сейчас»
//    
//    СписокПолей = "ИНН";
//    
//    Сведения = ОрганизацииСервер.СведенияОбОрганизации(Объект.Организация, СписокПолей, ДатаДляПолученияДанных);
//    
//    Если Сведения = Неопределено Или Сведения.Количество() = 0 Тогда
//        Сообщить("Не удалось получить сведения об организации.");
//        Возврат;
//    КонецЕсли;
//    
//    // Сведения — это массив структур (даже для одной организации)
//    ДанныеОрг = Сведения[0];
//    
//    Сообщить("ИНН: " + ДанныеОрг.ИНН);
//    
//КонецПроцедуры

&НаСервере
Процедура КонтрагентПриИзмененииНаСервере() 
	
	Если Не ЗначениеЗаполнено(Объект.Контрагент) Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	| Контрагенты.Ссылка КАК Ссылка,
	| Контрагенты.ИНН КАК ИНН,
	| Контрагенты.ПрефиксСчетаНаОплату КАК ПрефиксСчетаНаОплату,
	| Контрагенты.ПрефиксСуммы КАК ПрефиксСуммы
	|ИЗ
	| Справочник.Контрагенты КАК Контрагенты
	|ГДЕ
	| Контрагенты.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Объект.Контрагент);
	
	Результат = Запрос.Выполнить().Выбрать();
	
	Если Результат.Следующий() Тогда
		Объект.ИНН = Результат.ИНН; 
		Объект.ПрефиксСчетаНаОплату = Результат.ПрефиксСчетаНаОплату;        
		Объект.ПрефиксСуммы = Результат.ПрефиксСуммы;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КонтрагентПриИзменении(Элемент)
	КонтрагентПриИзмененииНаСервере();
КонецПроцедуры     

&НаКлиенте
Процедура ПересчитатьСуммуДокумента()
	Объект.СуммаДокумента = Объект.База.Итог("Сумма") + Объект.Дополнительно.Итог("Сумма");  
	
	Объект.СуммаБаза = Объект.База.Итог("Сумма");
КонецПроцедуры 

&НаКлиенте
Процедура БазаПриИзменении(Элемент)
	ПересчитатьСуммуДокумента();
КонецПроцедуры     

&НаКлиенте
Процедура БазаЦенаПриИзменении(Элемент)
	СтрокаТЧ = Элементы.База.ТекущиеДанные;
	РаботаСТабличнымиЧастямиКлиент.ПересчитатьСуммуВСтрокеТабличнойЧасти(СтрокаТЧ);
КонецПроцедуры

&НаКлиенте
Процедура БазаКоличествоПриИзменении(Элемент)
	СтрокаТЧ = Элементы.База.ТекущиеДанные;
	РаботаСТабличнымиЧастямиКлиент.ПересчитатьСуммуВСтрокеТабличнойЧасти(СтрокаТЧ);
КонецПроцедуры

&НаКлиенте
Процедура БазаНаименованиеПриИзменении(Элемент)  
	
	РедактироватьНаименование = Объект.РедактироватьНаименование;
	
	Если НЕ РедактироватьНаименование Тогда		
		СтрокаТЧ = Элементы.База.ТекущиеДанные;  
		ИсходноеНаименование = СтрокаТЧ.Наименование; 
		НомерДоговора = Объект.НомерДоговора;  
		ДатаВыполнения = Формат(Объект.ДатаВыполнения, "ДФ=dd.MM.yyyy");  
		СтрокаТЧ.Наименование = ИсходноеНаименование + " Договор " + НомерДоговора + " Срок выполнения: " + ДатаВыполнения + " г."; 		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДополнительноПриИзменении(Элемент)
	ПересчитатьСуммуДокумента();
КонецПроцедуры

&НаКлиенте
Процедура ДополнительноКоличествоПриИзменении(Элемент)
	СтрокаТЧ = Элементы.Дополнительно.ТекущиеДанные;
	РаботаСТабличнымиЧастямиКлиент.ПересчитатьСуммуВСтрокеТабличнойЧасти(СтрокаТЧ);
КонецПроцедуры

&НаКлиенте
Процедура ДополнительноЦенаПриИзменении(Элемент)
	СтрокаТЧ = Элементы.Дополнительно.ТекущиеДанные;
	РаботаСТабличнымиЧастямиКлиент.ПересчитатьСуммуВСтрокеТабличнойЧасти(СтрокаТЧ);
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка) 
	
	Если Объект.Ссылка.Пустая() Тогда
		Объект.ПризнакОплаты = Ложь; 
	Иначе
		Если НЕ Объект.ПризнакОплаты Тогда
			ПризнакОплаты = Документы.СчетаНаОплату.ПроверитьОплатуДокумента(Объект.Ссылка, Объект.СуммаДокумента, Объект.СуммаБаза);
			Объект.ПризнакОплаты = ПризнакОплаты;  
		КонецЕсли;
	КонецЕсли;	
	
	Если НЕ ЗначениеЗаполнено(Объект.АвторДокумента) Тогда
		Объект.АвторДокумента = Пользователи.ТекущийПользователь();
	КонецЕсли;  
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
КонецПроцедуры 

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);   
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	ПодключаемыеКомандыКлиент.ПослеЗаписи(ЭтотОбъект, Объект, ПараметрыЗаписи);
КонецПроцедуры



#Область ОбработчикиКомандФормы

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
    ПодключаемыеКомандыКлиент.НачатьВыполнениеКоманды(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПродолжитьВыполнениеКомандыНаСервере(ПараметрыВыполнения, ДополнительныеПараметры) Экспорт
    ВыполнитьКомандуНаСервере(ПараметрыВыполнения);
КонецПроцедуры

&НаСервере
Процедура ВыполнитьКомандуНаСервере(ПараметрыВыполнения)
    ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, ПараметрыВыполнения, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
    ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры

// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти

















