
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Если ЗначениеЗаполнено(Контрагент) Тогда
		Движения.УправлениеСтатусомЗаявок.Записывать = Истина;
		Движение = Движения.УправлениеСтатусомЗаявок.Добавить();
		Движение.Дата = Дата;
		Движение.СсылкаНаКонтрагента = Контрагент;
		Движение.ИсточникЗаявки = ИсточникЗаявки;
		Движение.СтатусЗаявки = Перечисления.СтатусыЗаявок.Новая;
		Движение.Период = Дата; 
		
		СменитьРодителя("Заявители");
	Иначе
		Отказ = Истина;
		Сообщить("Элемент не найден!");
	КонецЕсли;

КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)

	Если ТипЗнч(ДанныеЗаполнения) = Тип("СправочникСсылка.Контрагенты") Тогда
		Контрагент = ДанныеЗаполнения.Ссылка; 
		Комментарий = ДанныеЗаполнения.Комментарий;
	КонецЕсли;

КонецПроцедуры

Процедура СменитьРодителя(ИмяНовойГруппы)
	
    Элемент = ЭтотОбъект.Контрагент.ПолучитьОбъект();
    НоваяГруппа = Справочники.Контрагенты.НайтиПоНаименованию(ИмяНовойГруппы);
    
    Если Не НоваяГруппа.Пустая() Тогда
        Элемент.Родитель = НоваяГруппа;    
		Элемент.ТипКонтрагента = ПредопределенноеЗначение("Перечисление.ТипыКонтрагентов.Заявитель");
        Попытка
            Элемент.Записать();
            Сообщить("Родитель изменён на: " + ИмяНовойГруппы);
        Исключение
            Сообщить("Ошибка записи: " + ОписаниеОшибки());
            Отказ = Истина;
        КонецПопытки;
    Иначе
        Сообщить("Группа '" + ИмяНовойГруппы + "' не найдена!");
        Отказ = Истина;
	КонецЕсли;
	
КонецПроцедуры



