#Область ПрограммныйИнтерфейс

// СтандартныеПодсистемы.Печать

// Переопределяет настройки печати для объекта.
Процедура ПриОпределенииНастроекПечати(Настройки) Экспорт

    Настройки.ПриДобавленииКомандПечати = Истина;
    
КонецПроцедуры

// Заполняет список команд печати.
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт

    КомандаПечати = КомандыПечати.Добавить();
    КомандаПечати.Идентификатор = "СчетаНаОплату";
    КомандаПечати.Представление = НСтр("ru = ' Счет на оплату'");
    КомандаПечати.ПроверкаПроведенияПередПечатью = Истина;
    КомандаПечати.Порядок = 10; 
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "АктПечать";
	КомандаПечати.Представление = НСтр("ru = 'Акт печать'");
	КомандаПечати.ПроверкаПроведенияПередПечатью = Истина;
	КомандаПечати.Порядок = 50;

КонецПроцедуры     

// Конец СтандартныеПодсистемы.Печать

#КонецОбласти       

Функция ПроверитьОплатуДокумента(ДокументСНО, СуммаДокумента, СуммаБаза) Экспорт 
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДокументОснование", ДокументСНО);
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	СУММА(ПоступлениеДенежныхСредств.СуммаДокумента) КАК СуммаДокумента
	               |ИЗ
	               |	Документ.ПоступлениеДенежныхСредств КАК ПоступлениеДенежныхСредств
	               |ГДЕ
	               |	ПоступлениеДенежныхСредств.ДокументОснование = &ДокументОснование
	               |	И ПоступлениеДенежныхСредств.Проведен";  
	
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		ПризнакОплаты = Ложь;
	Иначе
		Выборка = Результат.Выбрать();
		Выборка.Следующий();
		Если ЗначениеЗаполнено(Выборка.СуммаДокумента) И Выборка.СуммаДокумента >= СуммаБаза Тогда
			ПризнакОплаты = Истина;
		Иначе
			ПризнакОплаты = Ложь;
		КонецЕсли;
	КонецЕсли;
	
	Возврат ПризнакОплаты;
		
КонецФункции