&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УстановитьВидимость();
	СформироватьНаименованиеДоговора();
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВидимость()
	Если Объект.ПризнакБессрочногоДоговора = Истина Тогда
		Элементы.ДатаОкончанияДоговора.Видимость = Ложь;
		Если ЗначениеЗаполнено(Объект.ДатаОкончанияДоговора) Тогда
			Объект.ДатаОкончанияДоговора = '0001,01,01';
		КонецЕсли;
	Иначе
		Элементы.ДатаОкончанияДоговора.Видимость = Истина;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПризнакБессрочногоДоговораПриИзменении(Элемент)
	УстановитьВидимость();
КонецПроцедуры

&НаКлиенте
Процедура НомерДоговораПриИзменении(Элемент)
	СформироватьНаименованиеДоговора();
КонецПроцедуры

&НаКлиенте
Процедура ДатаЗаключенияДоговораПриИзменении(Элемент)
	СформироватьНаименованиеДоговора();
КонецПроцедуры

&НаКлиенте
Процедура СформироватьНаименованиеДоговора()
	Если ЗначениеЗаполнено (Объект.НомерДоговора)
		И ЗначениеЗаполнено(Объект.ДатаЗаключенияДоговора) Тогда
		Объект.Наименование = "№ " + Объект.НомерДоговора + " от " + Формат(Объект.ДатаЗаключенияДоговора, "ДФ='dd.MM.yyyy'") + " г.";
	ИначеЕсли ЗначениеЗаполнено(Объект.НомерДоговора)
		И НЕ ЗначениеЗаполнено(Объект.ДатаЗаключенияДоговора) Тогда
		Объект.Наименование = "№ " + Объект.НомерДоговора;
	Иначе 
		Если Объект.ДатаЗаключенияДоговора = '0001,01,01' Тогда
			Объект.Наименование = " от " + Объект.ДатаЗаключенияДоговора;
		Иначе
			ДатаЗаключенияБезВремени = Формат(Объект.ДатаЗаключенияДоговора, "ДФ='dd.MM.yyyy'");
			Объект.Наименование = " от " + ДатаЗаключенияБезВремени + " г.";
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры